"""
 Реалізувати одновимірний масив, довжину масива та сам масив користувач має ввести з клавіатури. 
 Виконати над масивом обчислення, вказані  у Вашому варіанті.
Варіант 6. Дано одномірний масив, що складається з N цілочисельних елементів.
Масив користувач має ввести з клавіатури. Обчислити суму додатніх  елементів масиву, кратних трьом.
"""

n = int(input("Кількість елементів масиву = "))

print(f"Введіть {n} елемент масиву:")

arr = [int(input()) for _ in range(n)]

print("Отримано масив: ", arr)

#Обчислити суму додатніх  елементів масиву, кратних трьом.
sunElement = sum(x for x in arr if x > 0 and x % 3 == 0)
print("Сума додатніх елементів масиву, кратних трьом: ", sunElement)