"""
Реалізувати функцію, яка виконує операції над списками – задану за варіантом та друк списку на екран. 
Список користувач має вводити з клавіатури.

Варіант 6: Видалення елемента зі списку, елемент, який потрібно видалити, користувач вводить з клавіатури.
"""

def delete():

    A = list(map(int,input('Введіть елементи списку через пробіл: ').split()))

    print(A)

    k = int(input('Введіть індекс елемента, який потрібно видалити: '))
    result = []

    for x in range(len(A)):
        if x != k:
            result.append(A[x])

    print(result)

    return result

delete()