"""
Реалізувати функцію, яка виконує операції над множинами – задану за варіантом та друк множини на екран.
 У випадку, якщо задану варіантом операцію над множиною виконати не можна, перетворіть множину у список,
 а потім при виведенні на екран результуючий список перетворіть на множину.

Варіант 6: Маємо множину цифр {c, d}. Скласти програму, яка додає до цієї множини множину усіх голосних літер
"""
def search():

    A = input("Введіть елементи множини через пробіл: ")

    B = A.split()
    orig_set = set(B)

    vowels = set("aeiou")

    # якщо всі елементи — цифри →  union
    if all(x.isdigit() for x in B):
        result = orig_set | vowels
        print("Результат :", *sorted(result))
    else:
        # якщо є нецифрові символи → використовую список
        L = B[:] + list(vowels)
        print("операція неможлива — результуюча множина:", *sorted(set(L)))

    return

search()


